In [1]:
import pandas as pd
import numpy as np

In [2]:
data = pd.Series(np.random.randn(9),index=[['a','a','a','b','b','c','c','d','d'],[1,2,3,1,3,1,2,2,3]])
data

a  1   -0.526572
   2   -1.233984
   3    0.387935
b  1    0.730908
   3    1.147672
c  1   -1.729702
   2    1.120674
d  2   -0.500081
   3    0.295616
dtype: float64

In [3]:
data['b']

1    0.730908
3    1.147672
dtype: float64

In [4]:
data['b'][3]

1.1476720987070803

In [5]:
data['b':'c']

b  1    0.730908
   3    1.147672
c  1   -1.729702
   2    1.120674
dtype: float64

In [6]:
data.loc[['b','d']]

b  1    0.730908
   3    1.147672
d  2   -0.500081
   3    0.295616
dtype: float64

In [7]:
data.loc[:,2]

a   -1.233984
c    1.120674
d   -0.500081
dtype: float64

In [8]:
data.index

MultiIndex([('a', 1),
            ('a', 2),
            ('a', 3),
            ('b', 1),
            ('b', 3),
            ('c', 1),
            ('c', 2),
            ('d', 2),
            ('d', 3)],
           )

In [9]:
data.unstack()

          1         2         3
a -0.526572 -1.233984  0.387935
b  0.730908       NaN  1.147672
c -1.729702  1.120674       NaN
d       NaN -0.500081  0.295616

In [10]:
data.unstack().stack()

a  1   -0.526572
   2   -1.233984
   3    0.387935
b  1    0.730908
   3    1.147672
c  1   -1.729702
   2    1.120674
d  2   -0.500081
   3    0.295616
dtype: float64

In [11]:
frame = pd.DataFrame(np.arange(12).reshape(4,3),index=[['a','a','b','b'],[1,2,1,2]],columns=[['Ohio','Ohio','California'],['Green','Red','Green']])
frame

     Ohio     California
    Green Red      Green
a 1     0   1          2
  2     3   4          5
b 1     6   7          8
  2     9  10         11

In [12]:
frame.columns.name = 'state'

In [13]:
frame.index.names = ['Key1','Key2']

In [14]:
frame

           Ohio     California
          Green Red      Green
Key1 Key2
a    1        0   1          2
     2        3   4          5
b    1        6   7          8
     2        9  10         11

In [15]:
frame['Ohio']

           Green  Red
Key1 Key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

In [16]:
#MultiIndex.from_arrays([['Ohio', 'Ohio', 'Colorado'], ['Green', 'Red', 'Green']],names=['state', 'color'])

In [17]:
frame

           Ohio     California
          Green Red      Green
Key1 Key2
a    1        0   1          2
     2        3   4          5
b    1        6   7          8
     2        9  10         11

In [18]:
frame.swaplevel('Key1','Key2')

           Ohio     California
          Green Red      Green
Key2 Key1
1    a        0   1          2
2    a        3   4          5
1    b        6   7          8
2    b        9  10         11

In [19]:
frame.sort_index(level=1)

           Ohio     California
          Green Red      Green
Key1 Key2
a    1        0   1          2
b    1        6   7          8
a    2        3   4          5
b    2        9  10         11

In [20]:
frame.swaplevel(0, 1)

           Ohio     California
          Green Red      Green
Key2 Key1
1    a        0   1          2
2    a        3   4          5
1    b        6   7          8
2    b        9  10         11

In [21]:
frame.swaplevel(0, 1).sort_index(level=0)

           Ohio     California
          Green Red      Green
Key2 Key1
1    a        0   1          2
     b        6   7          8
2    a        3   4          5
     b        9  10         11

In [22]:
frame.sum(level='Key2')

C:\Users\Sami\AppData\Local\Temp\ipykernel_5856\3159291033.py:1: FutureWarning: Using the level keyword in DataFrame and Series aggregations is deprecated and will be removed in a future version. Use groupby instead. df.sum(level=1) should use df.groupby(level=1).sum().
  frame.sum(level='Key2')

      Ohio     California
     Green Red      Green
Key2
1        6   8         10
2       12  14         16

In [23]:
dic = {'a':range(7),'b':range(7,0,-1),'c':['one','one','one','two','two','two','two'],'d':[0,1,2,0,1,2,3]}
dic

{'a': range(0, 7),
 'b': range(7, 0, -1),
 'c': ['one', 'one', 'one', 'two', 'two', 'two', 'two'],
 'd': [0, 1, 2, 0, 1, 2, 3]}

In [24]:
frame = pd.DataFrame(dic)
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [25]:
frame2 = frame.set_index(['c','d'])
frame2

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [26]:
frame2 = frame.set_index(['c','d'],drop=False)
frame2

       a  b    c  d
c   d
one 0  0  7  one  0
    1  1  6  one  1
    2  2  5  one  2
two 0  3  4  two  0
    1  4  3  two  1
    2  5  2  two  2
    3  6  1  two  3

In [27]:
frame2.reset_index()

ValueError: cannot insert d, already exists

In [ ]:
df1 = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'a', 'b'],'data1':range(7)})
df1

In [ ]:
df2 = pd.DataFrame({'key': ['a', 'b', 'd'],'data2':range(3)})
df2

In [ ]:
pd.merge(df1,df2)

In [ ]:
pd.merge(df1,df2,on='key')

In [ ]:
df3 = pd.DataFrame({'lkey': ['b', 'b', 'a', 'c', 'a', 'a', 'b'],'data1': range(7)})
df4 = pd.DataFrame({'rkey': ['a', 'b', 'd'],'data2': range(3)})
df3

In [ ]:
df4

In [ ]:
# intersection of lkey and rkey
pd.merge(df3,df4,left_on='lkey',right_on='rkey')

In [ ]:
pd.merge(df1,df2,how='outer')

In [ ]:
df1 = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'],'data1': range(6)})
df1

In [ ]:
df2 = pd.DataFrame({'key': ['a', 'b', 'a', 'b', 'd'],'data2': range(5)})
df2

In [ ]:
pd.merge(df1,df2,on='key',how='left')

In [ ]:
left = pd.DataFrame({'key1': ['foo', 'foo', 'bar'],'key2': ['one', 'two', 'one'],'lval': [1, 2, 3]})
right = pd.DataFrame({'key1': ['foo', 'foo', 'bar', 'bar'],'key2': ['one', 'one', 'one', 'two'],'rval': [4, 5, 6, 7]})

In [ ]:
pd.merge(left, right, on=['key1', 'key2'], how='outer')

In [ ]:
pd.merge(left, right, on='key1')

In [ ]:
pd.merge(left, right, on='key1', suffixes=('_left', '_right'))

In [ ]:
left1 = pd.DataFrame({'key': ['a', 'b', 'a', 'a', 'b', 'c'],'value': range(6)})
right1 = pd.DataFrame({'group_val': [3.5, 7]}, index=['a', 'b'])

In [ ]:
pd.merge(left1, right1, left_on='key', right_index=True)

In [ ]:
pd.merge(left1, right1, left_on='key', right_index=True, how='outer')

In [ ]:
lefth = pd.DataFrame({'key1': ['Ohio', 'Ohio', 'Ohio','Nevada', 'Nevada'],'key2': [2000, 2001, 2002, 2001, 2002],
'data': np.arange(5.)})
righth = pd.DataFrame(np.arange(12).reshape((6, 2)),index=[['Nevada', 'Nevada', 'Ohio', 'Ohio','Ohio', 'Ohio'],[2001, 2000, 2000, 2000, 2001, 2002]],columns=['event1', 'event2'])

In [ ]:
pd.merge(lefth, righth, left_on=['key1', 'key2'], right_index=True)

In [ ]:
pd.merge(lefth, righth, left_on=['key1', 'key2'],right_index=True, how='outer')

In [ ]:
left2 = pd.DataFrame([[1., 2.], [3., 4.], [5., 6.]],index=['a', 'c', 'e'],columns=['Ohio', 'Nevada'])

In [ ]:
right2 = pd.DataFrame([[7., 8.], [9., 10.], [11., 12.], [13, 14]],index=['b', 'c', 'd', 'e'],columns=['Missouri', 'Alabama'])

In [ ]:
pd.merge(left2, right2, how='outer', left_index=True, right_index=True)

In [ ]:
left2.join(right2, how='outer')

In [ ]:
arr = np.arange(12).reshape(3,4)

In [ ]:
# by default axis equal to 0
np.concatenate([arr,arr])

In [ ]:
np.concatenate([arr,arr],axis=1)

In [ ]:
s1 = pd.Series([0,1],index=['a','b'])
s2 = pd.Series([2,3,4],index=['c','d','e'])
s3 = pd.Series([5,6],index=['f','g'])

In [ ]:
pd.concat([s1,s2,s3])

In [ ]:
pd.concat([s1,s2,s3],axis=1)

In [ ]:
s4 = pd.concat([s1,s3])

In [ ]:
s4

In [ ]:
s1

In [ ]:
pd.concat([s1,s4],axis=1)

In [ ]:
pd.concat([s1,s4],axis=1,join='inner')

In [ ]:
result = pd.concat([s1, s1, s3], keys=['one', 'two', 'three'])
result

In [ ]:
result.unstack()

In [ ]:
pd.concat([s1, s2, s3], axis=1, keys=['one', 'two', 'three'])

In [ ]:
df1 = pd.DataFrame(np.arange(6).reshape(3, 2), index=['a', 'b', 'c'],columns=['one', 'two'])

In [ ]:
df2 = pd.DataFrame(5 + np.arange(4).reshape(2, 2), index=['a', 'c'],columns=['three', 'four'])

In [ ]:
pd.concat([df1, df2], axis=1, keys=['level1', 'level2'])

In [ ]:
pd.concat({'level1': df1, 'level2': df2}, axis=1)

In [ ]:
pd.concat([df1, df2], axis=1, keys=['level1', 'level2'],names=['upper', 'lower'])

In [29]:
b = "Pakistan"
b[:-2]

'Pakist'

In [30]:
a = pd.Series([np.nan, 2.5, np.nan, 3.5, 4.5, np.nan],index=['f', 'e', 'd', 'c', 'b', 'a'])

In [31]:
b = pd.Series(np.arange(len(a), dtype=np.float64),index=['f', 'e', 'd', 'c', 'b', 'a'])

In [32]:
b[-1] = np.nan

In [35]:
np.where(pd.isnull(a),b,a)

array([0. , 2.5, 2. , 3.5, 4.5, nan])

In [36]:
b[:-2].combine_first(a[2:])

a    NaN
b    4.5
c    3.0
d    2.0
e    1.0
f    0.0
dtype: float64

In [37]:
df1 = pd.DataFrame({'a': [1., np.nan, 5., np.nan],'b': [np.nan, 2., np.nan, 6.],'c': range(2, 18, 4)})

In [38]:
df2 = pd.DataFrame({'a': [5., 4., np.nan, 3., 7.],'b': [np.nan, 3., 4., 6., 8.]})

In [39]:
df1.combine_first(df2)

     a    b     c
0  1.0  NaN   2.0
1  4.0  2.0   6.0
2  5.0  4.0  10.0
3  3.0  6.0  14.0
4  7.0  8.0   NaN

In [40]:
data = pd.DataFrame(np.arange(6).reshape((2, 3)),index=pd.Index(['Ohio', 'Colorado'], name='state'),
columns=pd.Index(['one', 'two', 'three'],name='number'))

In [41]:
data

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

In [42]:
data.stack()

state     number
Ohio      one       0
          two       1
          three     2
Colorado  one       3
          two       4
          three     5
dtype: int32

In [43]:
data.unstack()

number  state
one     Ohio        0
        Colorado    3
two     Ohio        1
        Colorado    4
three   Ohio        2
        Colorado    5
dtype: int32

In [44]:
data

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

In [49]:
data

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

In [55]:
ata = pd.DataFrame(np.arange(6).reshape((2, 3)),index=pd.Index(['Ohio', 'Colorado'], name='state'),
columns=pd.Index(['one', 'two', 'three'],name='number'))
data

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

In [57]:
result = data.stack()
result

state     number
Ohio      one       0
          two       1
          three     2
Colorado  one       3
          two       4
          three     5
dtype: int32

In [58]:
result.unstack()

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

In [59]:
result.unstack(0)

state   Ohio  Colorado
number
one        0         3
two        1         4
three      2         5

In [60]:
result.unstack('state')

state   Ohio  Colorado
number
one        0         3
two        1         4
three      2         5

In [63]:
s1 = pd.Series([0, 1, 2, 3], index=['a', 'b', 'c', 'd'])
s2 = pd.Series([4, 5, 6], index=['c', 'd', 'e'])
data2 = pd.concat([s1, s2], keys=['one', 'two'])
data2

one  a    0
     b    1
     c    2
     d    3
two  c    4
     d    5
     e    6
dtype: int64

In [65]:
data2.unstack()

       a    b    c    d    e
one  0.0  1.0  2.0  3.0  NaN
two  NaN  NaN  4.0  5.0  6.0

In [66]:
data2.unstack().stack()

one  a    0.0
     b    1.0
     c    2.0
     d    3.0
two  c    4.0
     d    5.0
     e    6.0
dtype: float64